In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.datasets import load_boston

In [2]:
df = pd.read_csv('states.csv')

In [6]:
df.shape

(51, 6)

In [12]:
df[:3]

     state  metro_res  white  hs_grad  poverty  female_house
0  Alabama       55.4   71.3     79.9     14.6          14.2
1   Alaska       65.6   70.8     90.6      8.3          10.8
2  Arizona       88.2   87.7     83.8     13.3          11.1

In [11]:
df.describe()

        metro_res      white    hs_grad    poverty  female_house
count   51.000000  51.000000  51.000000  51.000000     51.000000
mean    72.249020  81.719608  86.011765  11.349020     11.633333
std     15.275894  13.897223   3.725998   3.099185      2.356155
min     38.200000  25.900000  77.200000   5.600000      7.800000
25%     60.800000  76.800000  83.300000   9.250000      9.550000
50%     71.600000  85.400000  86.900000  10.600000     11.800000
75%     86.800000  90.250000  88.700000  13.400000     12.650000
max    100.000000  97.100000  92.100000  18.000000     18.900000

In [13]:
df.iloc[:3,:3]

     state  metro_res  white
0  Alabama       55.4   71.3
1   Alaska       65.6   70.8
2  Arizona       88.2   87.7

In [18]:
df.iloc[[0,3,10],[0,3,-1]]

       state  hs_grad  female_house
0    Alabama     79.9          14.2
3   Arkansas     80.9          12.1
10   Georgia     85.1          14.5

In [21]:
df[-3:]

             state  metro_res  white  hs_grad  poverty  female_house
48  West  Virginia       46.1   95.0     78.7     16.0          10.7
49       Wisconsin       68.3   90.1     88.6      8.6           9.6
50         Wyoming       65.1   94.7     90.9      9.5           8.7